{
  "sentences": [
    {
      "id": 1,
      "base": "Technology allows students to access information more quickly.",
      "explain": [
        "This means students can find what they need with just a few clicks.",
        "This helps learners get answers to questions without waiting for a teacher.",
        "This gives students more control over how they find and use information.",
        "This makes research for homework and projects much easier to manage.",
        "This allows students to check facts and learn more about any topic they are interested in."
      ],
      "reason": [
        "Online search tools bring results together in one place.",
        "Websites and digital libraries store large amounts of up-to-date information.",
        "Many schools use online platforms that give direct access to learning materials.",
        "Educational videos and articles are available on most devices.",
        "Modern devices connect to the internet in just a few seconds."
      ],
      "example": [
        "For example, a student can search for science facts online instead of looking through several books.",
        "A teenager can watch a short video to understand a maths problem more clearly.",
        "A learner can download a reading text from the school platform in a few seconds.",
        "Students can use a dictionary app to check new words during a lesson.",
        "Someone writing an essay can read different articles about the same topic on the internet."
      ],
      "result": [
        "As a result, students spend less time searching and more time learning.",
        "This leads to homework being completed more efficiently.",
        "This means learners can explore extra topics that interest them.",
        "This often improves the quality of school projects.",
        "This helps students feel more confident about finding reliable information."
      ],
      "reformulate": [
        "In other words, technology speeds up the way students look for information.",
        "Put simply, digital tools make research quicker for young people.",
        "To say it another way, students do not have to waste time searching through many books.",
        "In short, devices and the internet help students get information faster.",
        "To summarise, technology makes it easier and quicker for students to find what they need."
      ],
      "compare": [
        "Compared to using only printed books, using technology is much faster.",
        "In contrast to older methods, modern tools provide results in a few seconds.",
        "Compared to students in the past, today’s learners can access information more quickly.",
        "Unlike traditional libraries, online resources are available at any time.",
        "Compared to asking a teacher every time, searching online is more immediate."
      ],
      "contrast": [
        "However, some students feel overwhelmed when there is too much information online.",
        "On the other hand, not all websites give accurate or reliable facts.",
        "In contrast, slow internet connections can still delay students’ work.",
        "However, some learners get distracted by entertainment while searching.",
        "On the other hand, students without good devices cannot benefit from this advantage."
      ]
    },
    {
      "id": 2,
      "base": "Social media helps young people stay connected with their friends.",
      "explain": [
        "This means they can easily share messages, photos and updates.",
        "This allows them to keep in touch even when they live far away from each other.",
        "This helps friendships continue when people move to different schools or cities.",
        "This makes it simple to see what friends are doing each day.",
        "This keeps communication going outside school hours."
      ],
      "reason": [
        "Most social media platforms are designed for quick communication.",
        "Messaging features are available on almost every app.",
        "Many teenagers already have smartphones with internet access.",
        "Notifications show new messages as soon as they arrive.",
        "Group chats make it easy to talk to several friends at the same time."
      ],
      "example": [
        "For example, friends can send each other a short message after school.",
        "A teenager can share a photo from a trip with their classmates.",
        "Someone who moves to another country can still talk to old friends online.",
        "Students can create a group chat to discuss a project together.",
        "Friends can send birthday wishes even if they cannot meet in person."
      ],
      "result": [
        "As a result, friendships can continue even when people are busy.",
        "This helps young people feel less isolated when they are at home.",
        "This means important news reaches friends more quickly.",
        "This often strengthens friendships over time.",
        "This can make teenagers feel more supported in their daily lives."
      ],
      "reformulate": [
        "In other words, social media keeps communication between friends alive.",
        "Put simply, these apps make it easier for teenagers to stay in touch.",
        "To say it another way, young people can maintain friendships online.",
        "In short, social media gives friends a simple way to contact each other.",
        "To summarise, social platforms help teenagers remain connected."
      ],
      "compare": [
        "Compared to letters or emails, social media messages arrive more quickly.",
        "Unlike phone calls, social media lets people send short messages at any time.",
        "Compared to earlier generations, today’s teenagers find it easier to stay in contact.",
        "Unlike meeting face to face, online communication does not depend on distance.",
        "Compared to traditional methods, social media offers more ways to share moments."
      ],
      "contrast": [
        "However, some teenagers feel lonely if friends do not reply quickly.",
        "On the other hand, online conversations can sometimes replace real-life meetings.",
        "In contrast, misunderstandings can happen more easily in short messages.",
        "However, not all online interactions feel honest or meaningful.",
        "On the other hand, spending too long on social media can reduce time for offline activities."
      ]
    },
    {
      "id": 3,
      "base": "Online lessons give students more flexibility in their learning.",
      "explain": [
        "This means they can study at different times during the day.",
        "This allows students to learn from home instead of travelling every day.",
        "This gives learners more control over the speed of each lesson.",
        "This makes it possible to repeat parts they did not understand the first time.",
        "This helps students fit learning around other responsibilities."
      ],
      "reason": [
        "Many online platforms let students watch recorded lessons.",
        "Timetables for online courses can be more flexible than school timetables.",
        "Digital lessons can be paused and played again when necessary.",
        "Homework can be submitted electronically from any location.",
        "Teachers can share materials that students can access at any time."
      ],
      "example": [
        "For example, a student can watch a lesson again before an important exam.",
        "A teenager who has sports training can complete lessons later in the evening.",
        "Someone who feels unwell can follow the class from home.",
        "Learners who travel can still join lessons using a laptop or tablet.",
        "A student who finds a topic difficult can review the explanation more than once."
      ],
      "result": [
        "As a result, students can build a learning routine that suits their own needs.",
        "This allows learners to spend more time on subjects they find challenging.",
        "This makes it easier for students to catch up if they miss a lesson.",
        "This can reduce stress for teenagers with busy schedules.",
        "This often leads to more independent and responsible learning."
      ],
      "reformulate": [
        "In other words, online lessons give students more choice about how they study.",
        "Put simply, digital classes make learning more flexible for young people.",
        "To say it another way, students are not tied to a fixed classroom timetable.",
        "In short, online learning allows teenagers to organise their own study time.",
        "To summarise, virtual lessons offer more freedom in the way students learn."
      ],
      "compare": [
        "Compared to traditional lessons, online lessons can be followed from different places.",
        "Unlike classroom teaching, online classes can be recorded and watched again.",
        "Compared to a fixed timetable, digital learning can adapt more easily to students’ lives.",
        "Unlike face-to-face lessons, online courses are not limited by classroom space.",
        "Compared to older methods, modern platforms offer students more control over their study pace."
      ],
      "contrast": [
        "However, some students find it harder to concentrate during online lessons.",
        "On the other hand, not all teenagers have a quiet place at home to study.",
        "In contrast, technical problems can interrupt the learning process.",
        "However, some learners miss direct contact with their classmates and teachers.",
        "On the other hand, spending many hours in front of a screen can feel tiring."
      ]
    },
    {
      "id": 4,
      "base": "Regular exercise improves a teenager’s energy levels.",
      "explain": [
        "This means that young people feel more awake during the day.",
        "This helps teenagers stay alert in class and during activities.",
        "This makes everyday tasks feel easier to manage.",
        "This gives students the strength they need for school and hobbies.",
        "This supports a routine that feels more active and productive."
      ],
      "reason": [
        "The body becomes stronger after regular physical activity.",
        "Muscles work more efficiently when they are used often.",
        "Blood flow increases during exercise and brings more oxygen around the body.",
        "The heart becomes healthier when teenagers move more often.",
        "The body functions better when it stays active."
      ],
      "example": [
        "For example, a teenager who goes for a short run every day usually feels less tired in the morning.",
        "Students who join a sports club often notice they can concentrate longer in class.",
        "Someone who cycles to school may feel more awake during their lessons.",
        "A person who practises a sport twice a week normally feels more energetic at weekends.",
        "Teenagers who walk regularly often say they feel less sleepy during homework time."
      ],
      "result": [
        "As a result, teenagers find it easier to focus on schoolwork.",
        "This leads to daily routines that feel smoother and less stressful.",
        "This means students participate more actively in group tasks.",
        "This often makes young people feel more positive about their day.",
        "This can make school life more enjoyable and manageable."
      ],
      "reformulate": [
        "In other words, physical activity gives teenagers the energy they need to get through the day.",
        "Put simply, moving regularly helps young people stay physically and mentally refreshed.",
        "To say it another way, exercise makes students feel more awake and ready for challenges.",
        "In short, being active helps teenagers maintain strong and steady energy.",
        "To summarise, frequent movement keeps young people feeling lively and ready to learn."
      ],
      "compare": [
        "Compared to teenagers who do not exercise, active students usually feel more energetic.",
        "Unlike those who sit for most of the day, teenagers who move more often feel stronger.",
        "Compared to young people who avoid sport, regular exercisers handle long days more easily.",
        "Unlike a very quiet lifestyle, an active routine supports higher energy levels.",
        "Compared to classmates who never play sport, teenagers who exercise feel less tired."
      ],
      "contrast": [
        "However, teenagers who avoid exercise often feel tired much more quickly.",
        "On the other hand, students who rarely move during the day usually struggle to stay focused.",
        "In contrast, young people who spend long hours sitting often complain about low energy.",
        "However, teenagers who skip physical activity do not feel as alert during lessons.",
        "On the other hand, students who do no exercise often find daily tasks harder to complete."
      ]
    },
    {
      "id": 5,
      "base": "Healthy eating makes daily life feel more balanced.",
      "explain": [
        "This means people feel more steady throughout the day.",
        "This helps teenagers avoid sudden changes in energy.",
        "This makes it easier to stay in a good mood.",
        "This gives the body what it needs to function properly.",
        "This supports both physical health and mental wellbeing."
      ],
      "reason": [
        "Nutritious food provides the body with vitamins and minerals.",
        "Regular meals keep blood sugar levels more stable.",
        "Fresh fruit and vegetables support the immune system.",
        "Whole foods release energy slowly instead of all at once.",
        "Healthy choices reduce the amount of unnecessary sugar and fat."
      ],
      "example": [
        "For example, a student who eats a balanced breakfast feels more ready for school.",
        "Teenagers who choose fruit as a snack feel less heavy during afternoon lessons.",
        "Someone who drinks water regularly feels more comfortable during the day.",
        "A pupil who eats proper meals finds it easier to pay attention in class.",
        "Young people who eat a variety of foods often feel more relaxed and focused."
      ],
      "result": [
        "As a result, school days feel less tiring and more manageable.",
        "This leads to better concentration during lessons.",
        "This often reduces mood swings during busy weeks.",
        "This can improve performance in both sports and studies.",
        "This helps teenagers build long-term healthy habits."
      ],
      "reformulate": [
        "In other words, good nutrition keeps daily life more stable.",
        "Put simply, eating well helps teenagers feel balanced and in control.",
        "To say it another way, healthy meals support a calm and steady routine.",
        "In short, sensible food choices make each day easier to handle.",
        "To summarise, healthy eating supports a more balanced lifestyle."
      ],
      "compare": [
        "Compared to eating fast food every day, healthy meals give steadier energy.",
        "Unlike sugary snacks, balanced meals support teenagers for longer periods.",
        "Compared to irregular eating habits, a healthy diet makes days feel smoother.",
        "Unlike very heavy meals, lighter healthy options help students feel comfortable.",
        "Compared to those with poor diets, teenagers who eat well cope better with busy schedules."
      ],
      "contrast": [
        "However, teenagers who eat a lot of junk food often feel tired and uncomfortable.",
        "On the other hand, skipping meals can make students feel weak during lessons.",
        "In contrast, very unhealthy diets can cause sudden drops in energy.",
        "However, eating too many sweets can make it harder to concentrate.",
        "On the other hand, poor food choices often lead to a more stressful routine."
      ]
    },
    {
      "id": 6,
      "base": "Part-time work teaches teenagers useful practical skills.",
      "explain": [
        "This means they learn things they cannot always learn at school.",
        "This helps them understand how real workplaces function.",
        "This gives them experience of different responsibilities.",
        "This makes them more aware of how to manage tasks for other people.",
        "This prepares them for future jobs and adult life."
      ],
      "reason": [
        "Part-time jobs often require teenagers to follow clear instructions.",
        "Many roles involve dealing with customers or working in a team.",
        "Young workers have to manage their time carefully to arrive on time.",
        "Handling money or equipment teaches them to be more careful.",
        "Regular shifts show them how to organise their week around work."
      ],
      "example": [
        "For example, a teenager working in a shop learns how to serve customers politely.",
        "Someone with a café job learns how to work quickly during busy periods.",
        "A student helping in a sports club learns how to support younger children.",
        "A person with a weekend job at a market learns how to handle cash safely.",
        "Young people who work in a restaurant learn how to cooperate with a team."
      ],
      "result": [
        "As a result, teenagers feel more confident about entering full-time work later.",
        "This helps them build a stronger CV for future applications.",
        "This gives them real examples to talk about in interviews.",
        "This often increases their sense of responsibility.",
        "This can make them more independent in their daily lives."
      ],
      "reformulate": [
        "In other words, part-time jobs give teenagers real-life training.",
        "Put simply, working a few hours a week helps young people learn practical skills.",
        "To say it another way, real jobs teach teenagers how to deal with everyday situations.",
        "In short, part-time work is a useful way for teenagers to learn by doing.",
        "To summarise, having a job helps young people gain important experience."
      ],
      "compare": [
        "Compared to learning only in the classroom, part-time work feels more practical.",
        "Unlike school projects, real jobs often involve real customers and real money.",
        "Compared to students who never work, teenagers with jobs understand workplaces earlier.",
        "Unlike homework, paid work teaches teenagers how to take responsibility for tasks.",
        "Compared to only studying, combining work and school develops a wider range of skills."
      ],
      "contrast": [
        "However, some teenagers find it hard to balance work and school.",
        "On the other hand, long working hours can reduce time for homework and rest.",
        "In contrast, some jobs do not give teenagers much chance to learn new skills.",
        "However, low pay can make young people feel their effort is not valued.",
        "On the other hand, working too often can make school life more stressful."
      ]
    },
    {
      "id": 7,
      "base": "Travelling abroad helps young people understand different cultures.",
      "explain": [
        "This means they see how people live in other parts of the world.",
        "This helps them notice differences in language, traditions and daily routines.",
        "This gives them a closer look at how other societies are organised.",
        "This makes other ways of life feel more real and less distant.",
        "This encourages them to respect people with different backgrounds."
      ],
      "reason": [
        "Visiting another country exposes teenagers to new customs.",
        "Staying in a foreign place shows them different ways of solving problems.",
        "Meeting local people gives them a clearer idea of how others think.",
        "Trying new food and activities introduces them to local habits.",
        "Seeing new environments changes the way they view their own country."
      ],
      "example": [
        "For example, a student who visits another country sees how school life works there.",
        "A teenager who stays with a host family learns about everyday routines in that home.",
        "Someone who joins an exchange trip experiences new celebrations and festivals.",
        "Young people who travel to a busy city see how people move and work there.",
        "A person who visits a small village abroad observes different ways of living."
      ],
      "result": [
        "As a result, teenagers become more open-minded about other cultures.",
        "This helps them avoid making quick judgements about people from other countries.",
        "This often increases their interest in learning languages.",
        "This can make them more confident when meeting new people.",
        "This encourages them to think more carefully about global issues."
      ],
      "reformulate": [
        "In other words, travelling abroad gives young people a deeper view of other cultures.",
        "Put simply, visiting other countries helps teenagers understand different ways of living.",
        "To say it another way, travel shows young people how life works outside their own country.",
        "In short, going abroad teaches teenagers more about the world.",
        "To summarise, international travel helps young people learn about other cultures in a direct way."
      ],
      "compare": [
        "Compared to reading about other countries, visiting them gives a stronger impression.",
        "Unlike watching travel videos, real trips involve direct contact with local people.",
        "Compared to staying at home, travelling abroad offers more cultural experiences.",
        "Unlike learning only from textbooks, seeing another country in person feels more powerful.",
        "Compared to online pictures, walking through real streets shows culture more clearly."
      ],
      "contrast": [
        "However, some teenagers cannot travel abroad because it is too expensive.",
        "On the other hand, short trips may not be enough to understand a culture fully.",
        "In contrast, some visitors spend all their time with other tourists and learn very little.",
        "However, travelling without preparation can lead to misunderstandings.",
        "On the other hand, some young people do not feel comfortable in unfamiliar places."
      ]
    },
    {
      "id": 8,
      "base": "Reading books encourages students to think in deeper ways.",
      "explain": [
        "This means they spend more time reflecting on ideas and characters.",
        "This helps them consider different opinions and situations.",
        "This makes them ask more questions about the world around them.",
        "This gives them practice in imagining how other people feel.",
        "This supports the development of more thoughtful and careful thinking."
      ],
      "reason": [
        "Books often present complex stories and problems.",
        "Longer texts require students to follow ideas over many pages.",
        "Characters in books experience different emotions and choices.",
        "Plots usually show the results of decisions and actions.",
        "Descriptions in books invite readers to picture scenes in their minds."
      ],
      "example": [
        "For example, a student reading a novel thinks about why a character makes a difficult choice.",
        "A teenager reading a story about another country considers how life is different there.",
        "Someone reading a mystery book tries to work out the solution before the end.",
        "A reader of a historical novel reflects on how people lived in the past.",
        "Students who read non-fiction books think more carefully about real events."
      ],
      "result": [
        "As a result, students become better at understanding complex ideas.",
        "This helps them express their own opinions more clearly.",
        "This often improves their writing in school subjects.",
        "This can make classroom discussions richer and more interesting.",
        "This encourages them to approach new topics with curiosity."
      ],
      "reformulate": [
        "In other words, reading helps students develop deeper thinking skills.",
        "Put simply, books train young people to think more carefully about ideas.",
        "To say it another way, reading encourages students to look below the surface of a story.",
        "In short, regular reading helps teenagers think in a more thoughtful way.",
        "To summarise, books give students practice in deeper and more reflective thinking."
      ],
      "compare": [
        "Compared to short online posts, books usually explore ideas in greater detail.",
        "Unlike quick messages, long texts invite students to think for a longer time.",
        "Compared to watching a short video, reading a book encourages more reflection.",
        "Unlike simple worksheets, stories often show complicated situations.",
        "Compared to very brief texts, books give readers more space to think."
      ],
      "contrast": [
        "However, some students feel reading takes too long and avoid deeper thinking.",
        "On the other hand, reading only very simple texts does not develop thinking much.",
        "In contrast, spending all free time on social media may reduce time for reflective reading.",
        "However, students who never read books may find complex ideas harder to understand.",
        "On the other hand, choosing only easy stories can limit the growth of deeper thinking."
      ]
    },
    {
      "id": 9,
      "base": "Volunteering gives teenagers a stronger sense of community.",
      "explain": [
        "This means they feel more connected to the people around them.",
        "This helps them understand the needs of others in their area.",
        "This makes them feel more involved in local activities.",
        "This gives them a chance to support people in meaningful ways.",
        "This encourages a feeling of belonging and teamwork."
      ],
      "reason": [
        "Volunteering often involves working with local groups.",
        "Many community projects bring people of different ages together.",
        "Helping others makes teenagers aware of different situations.",
        "Taking part in local events introduces them to new people.",
        "Working on shared goals brings volunteers closer as a group."
      ],
      "example": [
        "For example, a student who helps at a charity shop meets many local residents.",
        "A teenager who joins a clean-up project learns more about their neighbourhood.",
        "Someone who volunteers at a youth club gets to know younger children.",
        "A person who helps at a food bank meets people who need support.",
        "Young volunteers who join local events feel more connected to their community."
      ],
      "result": [
        "As a result, teenagers often become more caring and responsible.",
        "This leads to better relationships with people in their area.",
        "This often motivates them to continue helping in the future.",
        "This can increase their confidence when meeting new people.",
        "This encourages them to take an active role in community life."
      ],
      "reformulate": [
        "In other words, volunteering helps young people feel part of their community.",
        "Put simply, helping others makes teenagers feel more included.",
        "To say it another way, volunteering strengthens teenagers’ connections with local people.",
        "In short, taking part in community projects gives young people a stronger sense of belonging.",
        "To summarise, volunteering helps teenagers feel closer to their community."
      ],
      "compare": [
        "Compared to teenagers who never volunteer, those who help others often feel more connected.",
        "Unlike staying at home, community work brings teenagers into contact with new people.",
        "Compared to online activities, volunteering builds stronger real-life connections.",
        "Unlike working alone, volunteering involves teamwork and shared goals.",
        "Compared to those who avoid local events, volunteers usually feel more involved."
      ],
      "contrast": [
        "However, some teenagers feel nervous about meeting new people when volunteering.",
        "On the other hand, not all community projects are well organised.",
        "In contrast, teenagers who never volunteer may feel less connected to their area.",
        "However, some young people prefer to help in private rather than join group activities.",
        "On the other hand, volunteering can feel tiring during busy school weeks."
      ]
    },
    {
      "id": 10,
      "base": "School clubs help students discover new interests.",
      "explain": [
        "This means students can try activities they have never done before.",
        "This helps them explore different hobbies in a safe environment.",
        "This makes it easier for them to find things they enjoy.",
        "This gives them opportunities to meet people with similar interests.",
        "This encourages them to be more open to new experiences."
      ],
      "reason": [
        "Clubs offer a range of activities that are not part of the main timetable.",
        "Many clubs are run by teachers or older students with experience.",
        "Clubs let students test different activities without pressure.",
        "School clubs are usually free to join, so anyone can try them.",
        "Trying new things at school feels safer than joining outside groups."
      ],
      "example": [
        "For example, a student who tries the drama club may realise they enjoy acting.",
        "A teenager who joins a science club may discover an interest in experiments.",
        "Someone who tries the photography club might find a new creative hobby.",
        "A person who joins a sports club may learn they enjoy team activities.",
        "Students who try coding club may discover a talent for technology."
      ],
      "result": [
        "As a result, students develop a wider range of skills.",
        "This helps them build confidence in trying unfamiliar things.",
        "This often leads to new friendships with classmates.",
        "This can inspire them to continue hobbies outside school.",
        "This encourages a more active and creative school life."
      ],
      "reformulate": [
        "In other words, school clubs help students find new things they enjoy.",
        "Put simply, clubs open up new interests for young people.",
        "To say it another way, clubs show students new possibilities.",
        "In short, joining school clubs helps students discover fresh interests.",
        "To summarise, clubs give students chances to explore new activities."
      ],
      "compare": [
        "Compared to staying at home after school, joining a club offers more variety.",
        "Unlike ordinary classes, clubs allow students to choose what they want to do.",
        "Compared to online hobbies, school clubs offer face-to-face interaction.",
        "Unlike expensive private courses, school clubs are usually free.",
        "Compared to students who never join clubs, club members explore more ideas."
      ],
      "contrast": [
        "However, some students feel shy about joining new clubs.",
        "On the other hand, not all clubs have enough equipment for everyone.",
        "In contrast, teenagers who avoid clubs may miss opportunities to explore new interests.",
        "However, some clubs require more time than busy students can give.",
        "On the other hand, a few students lose interest quickly and leave."
      ]
    },
    {
      "id": 11,
      "base": "Team sports help students build stronger friendships.",
      "explain": [
        "This means they spend time working closely with others.",
        "This helps them communicate clearly during games and training.",
        "This makes them feel part of a supportive group.",
        "This gives them chances to share successes and challenges.",
        "This encourages cooperation and trust between teammates."
      ],
      "reason": [
        "Team sports require players to work together to win.",
        "Many sports involve planning and communication during matches.",
        "Training sessions give players time to get to know one another.",
        "Shared goals encourage teammates to support each other.",
        "Sports teams often have regular social events."
      ],
      "example": [
        "For example, football players often form close friendships with their teammates.",
        "A student on a basketball team learns to communicate during fast games.",
        "Someone who joins a volleyball team spends time with new people during training.",
        "A person who plays hockey learns to trust others on the field.",
        "Teenagers in school teams often meet friends they would not meet in lessons."
      ],
      "result": [
        "As a result, students feel more connected to their teammates.",
        "This leads to friendships that last beyond school.",
        "This often improves confidence during social situations.",
        "This can help shy students feel more included.",
        "This encourages teenagers to support each other off the field."
      ],
      "reformulate": [
        "In other words, team sports help students make stronger friendships.",
        "Put simply, playing in a team brings young people closer together.",
        "To say it another way, sports help teenagers build lasting bonds.",
        "In short, team activities strengthen friendships.",
        "To summarise, playing team sports creates closer relationships between students."
      ],
      "compare": [
        "Compared to individual sports, team sports involve more communication.",
        "Unlike solo exercise, team activities encourage cooperation.",
        "Compared to students who do not join teams, players meet more new friends.",
        "Unlike private training, team sports focus on shared routines.",
        "Compared to quiet hobbies, team sports offer more social interaction."
      ],
      "contrast": [
        "However, some students feel nervous about joining large teams.",
        "On the other hand, disagreements between players can happen.",
        "In contrast, very competitive teams sometimes create pressure.",
        "However, injuries can affect friendships if someone cannot play.",
        "On the other hand, students who prefer quiet activities may not enjoy team sports."
      ]
    },
    {
      "id": 12,
      "base": "Art lessons give young people more freedom to express ideas.",
      "explain": [
        "This means they can show their thoughts through drawings and designs.",
        "This helps them communicate feelings in a creative way.",
        "This makes it easier to explore ideas without strict rules.",
        "This gives them space to experiment with colours and materials.",
        "This encourages them to think more imaginatively."
      ],
      "reason": [
        "Art classes usually allow for personal interpretation.",
        "Creative subjects focus less on right or wrong answers.",
        "Teachers often encourage students to develop individual styles.",
        "Projects let teenagers choose their own themes and topics.",
        "Art tasks support expression without needing many words."
      ],
      "example": [
        "For example, a student might show their emotions through abstract painting.",
        "A teenager may express their ideas by designing posters.",
        "Someone might use clay to create shapes that represent their feelings.",
        "A pupil could draw scenes that reflect their experiences.",
        "Young people may paint images that communicate their thoughts visually."
      ],
      "result": [
        "As a result, students feel more confident about sharing their ideas.",
        "This leads to more creative thinking in other school subjects.",
        "This often makes lessons more enjoyable and relaxing.",
        "This can help teenagers handle stress in a healthy way.",
        "This encourages students to appreciate different artistic styles."
      ],
      "reformulate": [
        "In other words, art lessons allow young people to express their ideas freely.",
        "Put simply, art gives students a creative way to communicate.",
        "To say it another way, creative subjects give teenagers space to express themselves.",
        "In short, art lessons help students show their thoughts in creative forms.",
        "To summarise, art provides teenagers with freedom to explore ideas visually."
      ],
      "compare": [
        "Compared to strict academic subjects, art offers more creative freedom.",
        "Unlike maths or science, art does not require exact answers.",
        "Compared to writing tasks, visual art uses images to express ideas.",
        "Unlike team sports, art lessons focus on personal interpretation.",
        "Compared to quiet reading, creating artwork involves more imagination."
      ],
      "contrast": [
        "However, some students feel unsure about their drawing skills.",
        "On the other hand, creative freedom can feel overwhelming for beginners.",
        "In contrast, teenagers who prefer structure may struggle with open tasks.",
        "However, art materials can be expensive for some schools.",
        "On the other hand, not every student enjoys expressing ideas visually."
      ]
    },
    {
      "id": 13,
      "base": "Music practice improves focus and self-discipline.",
      "explain": [
        "This means students learn to concentrate for longer periods.",
        "This helps them pay attention to small details in their work.",
        "This makes them more patient with difficult tasks.",
        "This gives them experience in following routines and progress steps.",
        "This encourages careful listening and steady concentration."
      ],
      "reason": [
        "Learning an instrument requires regular practice.",
        "Musicians must repeat pieces many times to improve.",
        "Playing music involves listening carefully to timing and tone.",
        "Progress depends on following a clear practice routine.",
        "Music tasks often need patience and steady effort."
      ],
      "example": [
        "For example, a student learning piano practises the same piece many times.",
        "A teenager in a school band works hard to match the group’s timing.",
        "Someone learning guitar concentrates on improving finger positions.",
        "A violin player must listen carefully to improve accuracy.",
        "Drummers practise patterns that develop rhythm and focus."
      ],
      "result": [
        "As a result, students become more disciplined in their schoolwork.",
        "This leads to stronger concentration during lessons.",
        "This often improves performance in other subjects, such as maths.",
        "This encourages teenagers to work patiently on long-term goals.",
        "This helps them stay focused even when tasks feel difficult."
      ],
      "reformulate": [
        "In other words, music practice helps students improve concentration and discipline.",
        "Put simply, practising music trains teenagers to focus.",
        "To say it another way, musical routines develop steady effort",
        "In short, music develops careful focus and self-control.",
        "To summarise, practising an instrument builds patience and concentration."
      ],
      "compare": [
        "Compared to quick hobbies, music requires more regular practice.",
        "Unlike team sports, music often involves working alone for long periods.",
        "Compared to short activities, learning an instrument takes steady effort.",
        "Unlike simple tasks, music demands careful attention to detail.",
        "Compared to casual listening, playing music develops stronger focus."
      ],
      "contrast": [
        "However, some teenagers find practice boring after a few weeks.",
        "On the other hand, busy schedules can reduce time for music.",
        "In contrast, students who do not practise regularly see little progress.",
        "However, some instruments are expensive to learn.",
        "On the other hand, not all students enjoy strict practice routines."
      ]
    },
    {
      "id": 14,
      "base": "Learning a foreign language creates more opportunities for the future.",
      "explain": [
        "This means students can communicate with people from other countries.",
        "This helps them take part in travel, study or work abroad.",
        "This makes it easier to understand international news and media.",
        "This gives them access to more information and perspectives.",
        "This encourages them to explore global ideas and cultures."
      ],
      "reason": [
        "Knowing another language opens doors to international experiences.",
        "Many universities value students who speak more than one language.",
        "Businesses often look for workers with language skills.",
        "Travelling becomes easier when people can speak the local language.",
        "Learning a language helps students think more flexibly."
      ],
      "example": [
        "For example, a student who speaks Spanish can communicate during trips to Spain or South America.",
        "A teenager who learns French can join exchange programmes more easily.",
        "Someone who speaks German may find more job options in Europe.",
        "A person who learns Japanese can enjoy films and books in their original language.",
        "Students with language skills can help visitors who do not speak English."
      ],
      "result": [
        "As a result, students have a wider range of choices for their future.",
        "This can give them an advantage when applying for courses.",
        "This often increases their confidence when travelling.",
        "This helps them adapt better to unfamiliar environments.",
        "This encourages them to explore opportunities outside their own country."
      ],
      "reformulate": [
        "In other words, learning a language opens many future opportunities.",
        "Put simply, language skills create more options in life.",
        "To say it another way, speaking another language gives students more chances.",
        "In short, foreign languages offer new possibilities for young people.",
        "To summarise, learning a language expands future opportunities."
      ],
      "compare": [
        "Compared to students who only speak one language, bilingual learners have more options.",
        "Unlike those who avoid languages, language learners develop international skills.",
        "Compared to focusing only on local subjects, languages open global possibilities.",
        "Unlike short-term skills, language knowledge remains useful throughout life.",
        "Compared to staying in one country, language skills support travel abroad."
      ],
      "contrast": [
        "However, some students find language grammar difficult.",
        "On the other hand, learning vocabulary takes time and patience.",
        "In contrast, students who give up early miss long-term benefits.",
        "However, some teenagers feel shy about speaking a new language.",
        "On the other hand, without practice, language skills quickly fade."
      ]
    },
    {
      "id": 15,
      "base": "Group projects make schoolwork feel more engaging.",
      "explain": [
        "This means students feel more involved in the activity.",
        "This helps them enjoy lessons more.",
        "This makes tasks feel more dynamic and interesting.",
        "This gives them chances to share different ideas.",
        "This encourages teamwork and communication."
      ],
      "reason": [
        "Working in groups allows students to combine strengths.",
        "Different people bring different ideas to the project.",
        "Shared tasks feel lighter when divided between members.",
        "Discussion keeps the activity active and lively.",
        "Group work often leads to more creative solutions."
      ],
      "example": [
        "For example, a group designing a poster can share creative responsibilities.",
        "A team researching a topic divides the work into smaller parts.",
        "A group acting out a story makes lessons more enjoyable.",
        "Students working on a science model share materials and ideas.",
        "Teenagers preparing a presentation often feel more confident in a team."
      ],
      "result": [
        "As a result, lessons feel more enjoyable and active.",
        "This helps students develop communication and teamwork skills.",
        "This often leads to better project outcomes.",
        "This can increase motivation in school subjects.",
        "This encourages students to take part more confidently."
      ],
      "reformulate": [
        "In other words, group projects make school tasks more interesting.",
        "Put simply, working with others makes learning more engaging.",
        "To say it another way, teamwork makes schoolwork feel more lively.",
        "In short, group activities encourage active learning.",
        "To summarise, group projects make lessons more interactive."
      ],
      "compare": [
        "Compared to working alone, group tasks feel more energetic.",
        "Unlike solo work, team projects involve sharing ideas.",
        "Compared to quiet study, group work offers more discussion.",
        "Unlike individual tasks, teamwork requires cooperation.",
        "Compared to simple worksheets, group projects feel more stimulating."
      ],
      "contrast": [
        "However, some students prefer working independently.",
        "On the other hand, disagreements can slow down group work.",
        "In contrast, some group members may not contribute equally.",
        "However, noise in groups can distract some learners.",
        "On the other hand, group work can feel stressful during tight deadlines."
      ]
    },
    {
      "id": 16,
      "base": "Saving money regularly helps teenagers plan for future goals.",
      "explain": [
        "This means they can prepare for things they want to buy later.",
        "This helps them think more carefully about spending.",
        "This makes big purchases feel more achievable over time.",
        "This gives them a sense of control over their finances.",
        "This encourages responsible habits from a young age."
      ],
      "reason": [
        "Putting money aside builds up savings slowly.",
        "Regular saving teaches teenagers how to manage income.",
        "Small amounts add up when saved consistently.",
        "Saving helps teenagers avoid spending everything at once.",
        "Planning ahead requires having some money available."
      ],
      "example": [
        "For example, a teenager saving weekly can afford a new phone later in the year.",
        "Someone who saves pocket money can buy birthday gifts for friends.",
        "A student who saves part of their earnings can pay for school trips.",
        "Young people who save early can buy equipment for hobbies.",
        "Saving regularly helps students buy things without asking parents for money."
      ],
      "result": [
        "As a result, teenagers feel more confident about money decisions.",
        "This helps them avoid unnecessary spending.",
        "This often leads to better habits in adulthood.",
        "This can reduce stress when unexpected costs appear.",
        "This encourages young people to think about long-term plans."
      ],
      "reformulate": [
        "In other words, saving money teaches teenagers to prepare for the future.",
        "Put simply, regular saving helps young people reach their goals.",
        "To say it another way, putting money aside supports future plans.",
        "In short, saving regularly helps teenagers stay organised with money.",
        "To summarise, saving money gives young people better control over their future choices."
      ],
      "compare": [
        "Compared to spending everything, saving provides more future options.",
        "Unlike impulsive buying, regular saving supports long-term planning.",
        "Compared to borrowing money, saving feels more secure.",
        "Unlike waiting for gifts, saving helps teenagers buy things themselves.",
        "Compared to students who never save, organised savers reach goals sooner."
      ],
      "contrast": [
        "However, some teenagers find it difficult to save regularly.",
        "On the other hand, unexpected costs can stop saving plans.",
        "In contrast, students who save too strictly may miss enjoyable activities.",
        "However, saving is harder for teenagers who do not earn money.",
        "On the other hand, poor planning can lead to inconsistent saving."
     ]
    },
    {
      "id": 17,
      "base": "A tidy study space makes homework feel less stressful.",
      "explain": [
        "This means students can focus more easily on their work.",
        "This helps them find the materials they need more quickly.",
        "This makes studying feel calmer and more organised.",
        "This gives them a quiet area that supports concentration.",
        "This encourages a smoother homework routine."
      ],
      "reason": [
        "A clean desk reduces distractions.",
        "Organised materials prevent wasted time searching for items.",
        "Messy spaces make it harder to stay focused.",
        "A tidy area creates a clearer mindset.",
        "Good organisation supports better study habits."
      ],
      "example": [
        "For example, a student with a tidy desk often finishes homework faster.",
        "Someone who keeps books organised finds tasks easier to start.",
        "A teenager with a clean study area feels calmer when revising.",
        "A person who clears their desk daily feels more ready to work.",
        "Students with organised folders avoid stress during busy weeks."
      ],
      "result": [
        "As a result, homework becomes easier to manage.",
        "This helps students complete tasks with less frustration.",
        "This often improves their overall productivity.",
        "This can lead to higher confidence during study sessions.",
        "This encourages a more positive attitude towards homework."
      ],
      "reformulate": [
        "In other words, a clean study area makes homework feel easier.",
        "Put simply, a tidy workspace reduces stress.",
        "To say it another way, organisation makes studying more comfortable.",
        "In short, tidy environments support relaxed homework sessions.",
        "To summarise, keeping a study area clean makes homework less stressful."
      ],
      "compare": [
        "Compared to messy desks, tidy spaces make studying smoother.",
        "Unlike noisy rooms, organised areas support better concentration.",
        "Compared to cluttered spaces, clean desks reduce stress.",
        "Unlike working in bed, studying at a desk feels more focused.",
        "Compared to crowded tables, organised spaces feel more productive."
      ],
      "contrast": [
        "However, some teenagers struggle to keep their desks tidy.",
        "On the other hand, not everyone has a quiet place to study.",
        "In contrast, messy spaces can increase stress during homework.",
        "However, busy schedules sometimes make tidying difficult.",
        "On the other hand, some students prefer a more relaxed environment."
      ]
    },
    {
      "id": 18,
      "base": "Good sleep improves a student’s ability to concentrate.",
      "explain": [
        "This means they can stay focused for longer periods.",
        "This helps them understand lessons more clearly.",
        "This makes school tasks feel easier to complete.",
        "This gives their brain time to rest and recover.",
        "This encourages a more alert and active mindset."
      ],
      "reason": [
        "Sleep restores energy for the next day.",
        "The brain processes information during rest.",
        "Lack of sleep makes it harder to pay attention.",
        "A healthy sleep routine supports clear thinking.",
        "Tiredness reduces concentration and memory."
      ],
      "example": [
        "For example, a student who sleeps well finds morning lessons easier to follow.",
        "Someone who gets enough rest can focus for longer during exams.",
        "A teenager with a good sleep routine feels more awake in class.",
        "A person who goes to bed early has better concentration the next day.",
        "Students who avoid late nights often perform better in lessons."
      ],
      "result": [
        "As a result, students learn more effectively.",
        "This helps them complete tasks with fewer mistakes.",
        "This often improves school performance.",
        "This can increase motivation during lessons.",
        "This encourages healthier daily habits."
      ],
      "reformulate": [
        "In other words, sleeping well helps students concentrate.",
        "Put simply, good sleep supports clear thinking.",
        "To say it another way, rest improves focus.",
        "In short, sleep strengthens a student’s attention.",
        "To summarise, proper sleep boosts concentration."
      ],
      "compare": [
        "Compared to tired students, well-rested students focus more easily.",
        "Unlike late-night gamers, early sleepers feel more alert.",
        "Compared to noisy nights, peaceful sleep supports better thinking.",
        "Unlike rushed mornings, rested students feel more prepared.",
        "Compared to irregular routines, steady sleep provides more focus."
      ],
      "contrast": [
        "However, many teenagers struggle with late-night habits.",
        "On the other hand, school schedules can make mornings difficult.",
        "In contrast, tired students find it harder to stay focused.",
        "However, some students need more sleep than others.",
        "On the other hand, stress can interfere with sleep quality."
      ]
    },
    {
      "id": 19,
      "base": "Outdoor activities help young people feel more confident.",
      "explain": [
        "This means they gain experience in new situations.",
        "This helps them feel stronger and more capable.",
        "This makes challenges feel easier to manage.",
        "This gives them opportunities to test their abilities.",
        "This encourages a sense of achievement."
      ],
      "reason": [
        "Outdoor tasks often involve physical challenges.",
        "Being outside exposes teenagers to new environments.",
        "Completing tasks outdoors builds trust in their abilities.",
        "Nature-based activities support positive mental health.",
        "Trying new outdoor skills boosts self-belief."
      ],
      "example": [
        "For example, hiking can help a teenager feel proud of finishing difficult routes.",
        "A young person who learns to climb feels more confident afterwards.",
        "Someone who takes part in outdoor sports gains new skills.",
        "A student who joins a camping trip learns independence.",
        "Teenagers who explore local nature areas feel stronger and braver."
      ],
      "result": [
        "As a result, young people approach challenges more confidently.",
        "This helps them deal with problems in daily life.",
        "This often boosts their motivation at school.",
        "This can reduce stress and improve mood.",
        "This encourages them to try new activities more often."
      ],
      "reformulate": [
        "In other words, spending time outdoors builds confidence.",
        "Put simply, outdoor experiences make young people feel stronger.",
        "To say it another way, nature activities increase self-belief.",
        "In short, outdoor tasks help teenagers feel more capable.",
        "To summarise, outdoor activities support growing confidence."
      ],
      "compare": [
        "Compared to indoor hobbies, outdoor activities build more physical confidence.",
        "Unlike online games, outdoor tasks require real-world skills.",
        "Compared to staying at home, being outdoors feels more adventurous.",
        "Unlike quiet activities, outdoor challenges boost bravery.",
        "Compared to passive entertainment, outdoor tasks build resilience."
      ],
      "contrast": [
        "However, some teenagers feel nervous in outdoor environments.",
        "On the other hand, bad weather can make outdoor activities difficult.",
        "In contrast, indoor activities may feel safer for some students.",
        "However, outdoor tasks require more planning and equipment.",
        "On the other hand, some young people prefer calmer, indoor hobbies."
      ]
    },
    {
      "id": 20,
      "base": "Watching documentaries helps students learn about global issues.",
      "explain": [
        "This means they gain information about different parts of the world.",
        "This helps them understand problems other countries face.",
        "This makes complex topics easier to visualise.",
        "This gives them access to real examples and stories.",
        "This encourages a wider awareness of world challenges."
      ],
      "reason": [
        "Documentaries present real events and facts.",
        "Visual information makes learning clearer.",
        "Different viewpoints are shown through interviews.",
        "Real footage helps students understand situations better.",
        "Documentaries explain topics in simple, clear ways."
      ],
      "example": [
        "For example, a documentary about climate change explains how it affects daily life.",
        "Students who watch wildlife documentaries learn about endangered species.",
        "A teenager watching a film about recycling sees how waste affects the planet.",
        "Someone who watches a documentary about world poverty understands the challenges people face.",
        "A student watching a travel documentary learns about traditions in different countries."
      ],
      "result": [
        "As a result, students become more informed about the world.",
        "This helps them think more critically about world events.",
        "This often encourages interest in geography or science.",
        "This can inspire them to take positive environmental actions.",
        "This encourages discussions about global topics in class."
      ],
      "reformulate": [
        "In other words, documentaries teach students about issues around the world.",
        "Put simply, documentary films make global topics easier to learn.",
        "To say it another way, documentaries give students a clearer view of global problems.",
        "In short, watching documentaries increases global understanding.",
        "To summarise, documentaries help students learn about important world issues."
      ],
      "compare": [
        "Compared to textbooks, documentaries show more real-life examples.",
        "Unlike short videos, documentaries explain topics in depth.",
        "Compared to lectures, films feel more engaging.",
        "Unlike fiction films, documentaries focus on real events.",
        "Compared to reading articles, documentaries use visual storytelling."
      ],
      "contrast": [
        "However, some documentaries may present limited viewpoints.",
        "On the other hand, not all films are completely accurate.",
        "In contrast, some students prefer reading to watching.",
        "However, long documentaries can be difficult to follow.",
        "On the other hand, some topics may feel too serious for younger viewers."
      ]
    },
    {
      "id": 21,
      "base": "Living in a big city gives teenagers more independence.",
      "explain": [
        "This means they can move around more freely.",
        "This helps them learn to manage their own time.",
        "This makes daily travel easier for them.",
        "This gives them access to more places and activities.",
        "This encourages them to take responsibility for their own routine."
      ],
      "reason": [
        "Cities offer more transport options.",
        "Shops and services are usually closer together.",
        "Public places allow teenagers to meet friends easily.",
        "Large cities provide more after-school activities.",
        "Urban life encourages teenagers to make independent choices."
      ],
      "example": [
        "For example, city teenagers often take public transport to school.",
        "A young person in a city can visit libraries or sports centres on their own.",
        "Someone living in a city may travel to music lessons independently.",
        "A teenager in an urban area can meet friends without needing a car.",
        "City students often walk to cafés or shops after school."
      ],
      "result": [
        "As a result, teenagers become more confident in daily life.",
        "This helps them organise their own schedules.",
        "This often prepares them for adult responsibilities.",
        "This can improve problem-solving in real situations.",
        "This encourages them to explore new interests."
      ],
      "reformulate": [
        "In other words, city life helps teenagers become more independent.",
        "Put simply, living in a city gives young people more freedom.",
        "To say it another way, urban areas help teenagers manage life on their own.",
        "In short, cities support independent routines.",
        "To summarise, living in a big city increases teenage independence."
      ],
      "compare": [
        "Compared to small towns, cities offer more places teenagers can visit alone.",
        "Unlike quiet villages, cities have more transport choices.",
        "Compared to rural areas, city life gives teenagers more freedom.",
        "Unlike small communities, cities provide more activities nearby.",
        "Compared to countryside living, city life feels more independent."
      ],
      "contrast": [
        "However, city life can feel busy or overwhelming.",
        "On the other hand, transport can be crowded and stressful.",
        "In contrast, small towns feel safer for some families.",
        "However, independence sometimes leads to risky choices.",
        "On the other hand, not all teenagers enjoy busy city life."
      ]
    },
    {
      "id": 22,
      "base": "Living in a small town creates a calmer daily routine.",
      "explain": [
        "This means life feels less rushed.",
        "This helps people relax during everyday activities.",
        "This makes school mornings feel less stressful.",
        "This gives teenagers more time to enjoy quiet moments.",
        "This encourages a slower and more comfortable lifestyle."
      ],
      "reason": [
        "Small towns have less traffic and noise.",
        "Shops and schools are usually close to home.",
        "People often know each other well in small communities.",
        "Crowds are smaller, so daily tasks feel easier.",
        "Local areas tend to be quieter and more peaceful."
      ],
      "example": [
        "For example, a teenager in a small town may walk to school without rushing.",
        "A young person can visit friends without dealing with heavy traffic.",
        "Someone living locally may enjoy peaceful parks and open spaces.",
        "A student might have more quiet time for hobbies after school.",
        "Families in small towns often enjoy slower, more relaxed weekends."
      ],
      "result": [
        "As a result, teenagers feel less stressed during the week.",
        "This helps them stay calm during homework or revision.",
        "This often improves their mood and wellbeing.",
        "This can support better concentration at school.",
        "This encourages stronger connections with local people."
      ],
      "reformulate": [
        "In other words, small towns offer a more peaceful routine.",
        "Put simply, life feels calmer in smaller communities.",
        "To say it another way, small-town living reduces daily stress.",
        "In short, small towns create quieter lifestyles.",
        "To summarise, small-town life supports a more relaxed routine."
      ],
      "compare": [
        "Compared to cities, small towns feel quieter and calmer.",
        "Unlike busy urban areas, small towns have fewer crowds.",
        "Compared to large cities, local life moves more slowly.",
        "Unlike noisy environments, small towns feel more peaceful.",
        "Compared to urban living, small towns offer more quiet spaces."
      ],
      "contrast": [
        "However, some teenagers find small towns too quiet.",
        "On the other hand, there may be fewer entertainment options.",
        "In contrast, cities offer more excitement and variety.",
        "However, small towns can feel isolated for some young people.",
        "On the other hand, fewer transport options can limit independence."
      ]
    },
    {
      "id": 23,
      "base": "Public transport helps students travel easily without a car.",
      "explain": [
        "This means they can move around independently.",
        "This helps them reach school or activities safely.",
        "This makes long distances feel easier to manage.",
        "This gives them reliable ways to get around.",
        "This encourages freedom of movement for young people."
      ],
      "reason": [
        "Buses and trains follow regular timetables.",
        "Public transport is cheaper than owning a car.",
        "Transport services connect many important locations.",
        "Students often receive discounted fares.",
        "Large cities have many different transport options."
      ],
      "example": [
        "For example, a student can take the bus to school every morning.",
        "A teenager might use the train to visit friends in another area.",
        "Someone can take the tram to a sports centre.",
        "A pupil might use the underground to reach a museum.",
        "Students often rely on buses for weekend activities."
      ],
      "result": [
        "As a result, teenagers feel more independent.",
        "This helps them join after-school clubs more easily.",
        "This often reduces pressure on parents.",
        "This can improve punctuality for school and activities.",
        "This encourages teenagers to explore their local area."
      ],
      "reformulate": [
        "In other words, public transport helps students travel on their own.",
        "Put simply, buses and trains give teenagers more freedom.",
        "To say it another way, public transport supports independent travel.",
        "In short, transport services help young people get around easily.",
        "To summarise, public transport allows students to travel without needing a car."
      ],
      "compare": [
        "Compared to walking long distances, buses are much faster.",
        "Unlike taxis, public transport is more affordable.",
        "Compared to relying on parents, buses give more independence.",
        "Unlike cars, buses provide shared travel for many people.",
        "Compared to cycling in bad weather, public transport feels more comfortable."
      ],
      "contrast": [
        "However, buses can be late during busy times.",
        "On the other hand, some areas have limited transport routes.",
        "In contrast, cars offer more privacy and flexibility.",
        "However, crowded buses can feel uncomfortable.",
        "On the other hand, confusing timetables can cause problems for new users."
      ]
    },
    {
      "id": 17,
      "base": "A tidy study space makes homework feel less stressful.",
      "explain": [
        "This means students can focus more easily on their work.",
        "This helps them find the materials they need more quickly.",
        "This makes studying feel calmer and more organised.",
        "This gives them a quiet area that supports concentration.",
        "This encourages a smoother homework routine."
      ],
      "reason": [
        "A clean desk reduces distractions.",
        "Organised materials prevent wasted time searching for items.",
        "Messy spaces make it harder to stay focused.",
        "A tidy area creates a clearer mindset.",
        "Good organisation supports better study habits."
      ],
      "example": [
        "For example, a student with a tidy desk often finishes homework faster.",
        "Someone who keeps books organised finds tasks easier to start.",
        "A teenager with a clean study area feels calmer when revising.",
        "A person who clears their desk daily feels more ready to work.",
        "Students with organised folders avoid stress during busy weeks."
      ],
      "result": [
        "As a result, homework becomes easier to manage.",
        "This helps students complete tasks with less frustration.",
        "This often improves their overall productivity.",
        "This can lead to higher confidence during study sessions.",
        "This encourages a more positive attitude towards homework."
      ],
      "reformulate": [
        "In other words, a clean study area makes homework feel easier.",
        "Put simply, a tidy workspace reduces stress.",
        "To say it another way, organisation makes studying more comfortable.",
        "In short, tidy environments support relaxed homework sessions.",
        "To summarise, keeping a study area clean makes homework less stressful."
      ],
      "compare": [
        "Compared to messy desks, tidy spaces make studying smoother.",
        "Unlike noisy rooms, organised areas support better concentration.",
        "Compared to cluttered spaces, clean desks reduce stress.",
        "Unlike working in bed, studying at a desk feels more focused.",
        "Compared to crowded tables, organised spaces feel more productive."
      ],
      "contrast": [
        "However, some teenagers struggle to keep their desks tidy.",
        "On the other hand, not everyone has a quiet place to study.",
        "In contrast, messy spaces can increase stress during homework.",
        "However, busy schedules sometimes make tidying difficult.",
        "On the other hand, some students prefer a more relaxed environment."
      ]
    },
    {
      "id": 18,
      "base": "Good sleep improves a student’s ability to concentrate.",
      "explain": [
        "This means they can stay focused for longer periods.",
        "This helps them understand lessons more clearly.",
        "This makes school tasks feel easier to complete.",
        "This gives their brain time to rest and recover.",
        "This encourages a more alert and active mindset."
      ],
      "reason": [
        "Sleep restores energy for the next day.",
        "The brain processes information during rest.",
        "Lack of sleep makes it harder to pay attention.",
        "A healthy sleep routine supports clear thinking.",
        "Tiredness reduces concentration and memory."
      ],
      "example": [
        "For example, a student who sleeps well finds morning lessons easier to follow.",
        "Someone who gets enough rest can focus for longer during exams.",
        "A teenager with a good sleep routine feels more awake in class.",
        "A person who goes to bed early has better concentration the next day.",
        "Students who avoid late nights often perform better in lessons."
      ],
      "result": [
        "As a result, students learn more effectively.",
        "This helps them complete tasks with fewer mistakes.",
        "This often improves school performance.",
        "This can increase motivation during lessons.",
        "This encourages healthier daily habits."
      ],
      "reformulate": [
        "In other words, sleeping well helps students concentrate.",
        "Put simply, good sleep supports clear thinking.",
        "To say it another way, rest improves focus.",
        "In short, sleep strengthens a student’s attention.",
        "To summarise, proper sleep boosts concentration."
      ],
      "compare": [
        "Compared to tired students, well-rested students focus more easily.",
        "Unlike late-night gamers, early sleepers feel more alert.",
        "Compared to noisy nights, peaceful sleep supports better thinking.",
        "Unlike rushed mornings, rested students feel more prepared.",
        "Compared to irregular routines, steady sleep provides more focus."
      ],
      "contrast": [
        "However, many teenagers struggle with late-night habits.",
        "On the other hand, school schedules can make mornings difficult.",
        "In contrast, tired students find it harder to stay focused.",
        "However, some students need more sleep than others.",
        "On the other hand, stress can interfere with sleep quality."
      ]
    },
    {
      "id": 19,
      "base": "Outdoor activities help young people feel more confident.",
      "explain": [
        "This means they gain experience in new situations.",
        "This helps them feel stronger and more capable.",
        "This makes challenges feel easier to manage.",
        "This gives them opportunities to test their abilities.",
        "This encourages a sense of achievement."
      ],
      "reason": [
        "Outdoor tasks often involve physical challenges.",
        "Being outside exposes teenagers to new environments.",
        "Completing tasks outdoors builds trust in their abilities.",
        "Nature-based activities support positive mental health.",
        "Trying new outdoor skills boosts self-belief."
      ],
      "example": [
        "For example, hiking can help a teenager feel proud of finishing difficult routes.",
        "A young person who learns to climb feels more confident afterwards.",
        "Someone who takes part in outdoor sports gains new skills.",
        "A student who joins a camping trip learns independence.",
        "Teenagers who explore local nature areas feel stronger and braver."
      ],
      "result": [
        "As a result, young people approach challenges more confidently.",
        "This helps them deal with problems in daily life.",
        "This often boosts their motivation at school.",
        "This can reduce stress and improve mood.",
        "This encourages them to try new activities more often."
      ],
      "reformulate": [
        "In other words, spending time outdoors builds confidence.",
        "Put simply, outdoor experiences make young people feel stronger.",
        "To say it another way, nature activities increase self-belief.",
        "In short, outdoor tasks help teenagers feel more capable.",
        "To summarise, outdoor activities support growing confidence."
      ],
      "compare": [
        "Compared to indoor hobbies, outdoor activities build more physical confidence.",
        "Unlike online games, outdoor tasks require real-world skills.",
        "Compared to staying at home, being outdoors feels more adventurous.",
        "Unlike quiet activities, outdoor challenges boost bravery.",
        "Compared to passive entertainment, outdoor tasks build resilience."
      ],
      "contrast": [
        "However, some teenagers feel nervous in outdoor environments.",
        "On the other hand, bad weather can make outdoor activities difficult.",
        "In contrast, indoor activities may feel safer for some students.",
        "However, outdoor tasks require more planning and equipment.",
        "On the other hand, some young people prefer calmer, indoor hobbies."
      ]
    },
    {
      "id": 20,
      "base": "Watching documentaries helps students learn about global issues.",
      "explain": [
        "This means they gain information about different parts of the world.",
        "This helps them understand problems other countries face.",
        "This makes complex topics easier to visualise.",
        "This gives them access to real examples and stories.",
        "This encourages a wider awareness of world challenges."
      ],
      "reason": [
        "Documentaries present real events and facts.",
        "Visual information makes learning clearer.",
        "Different viewpoints are shown through interviews.",
        "Real footage helps students understand situations better.",
        "Documentaries explain topics in simple, clear ways."
      ],
      "example": [
        "For example, a documentary about climate change explains how it affects daily life.",
        "Students who watch wildlife documentaries learn about endangered species.",
        "A teenager watching a film about recycling sees how waste affects the planet.",
        "Someone who watches a documentary about world poverty understands the challenges people face.",
        "A student watching a travel documentary learns about traditions in different countries."
      ],
      "result": [
        "As a result, students become more informed about the world.",
        "This helps them think more critically about world events.",
        "This often encourages interest in geography or science.",
        "This can inspire them to take positive environmental actions.",
        "This encourages discussions about global topics in class."
      ],
      "reformulate": [
        "In other words, documentaries teach students about issues around the world.",
        "Put simply, documentary films make global topics easier to learn.",
        "To say it another way, documentaries give students a clearer view of global problems.",
        "In short, watching documentaries increases global understanding.",
        "To summarise, documentaries help students learn about important world issues."
      ],
      "compare": [
        "Compared to textbooks, documentaries show more real-life examples.",
        "Unlike short videos, documentaries explain topics in depth.",
        "Compared to lectures, films feel more engaging.",
        "Unlike fiction films, documentaries focus on real events.",
        "Compared to reading articles, documentaries use visual storytelling."
      ],
      "contrast": [
        "However, some documentaries may present limited viewpoints.",
        "On the other hand, not all films are completely accurate.",
        "In contrast, some students prefer reading to watching.",
        "However, long documentaries can be difficult to follow.",
        "On the other hand, some topics may feel too serious for younger viewers."
      ]
    },
    {
      "id": 21,
      "base": "Living in a big city gives teenagers more independence.",
      "explain": [
        "This means they can move around more freely.",
        "This helps them learn to manage their own time.",
        "This makes daily travel easier for them.",
        "This gives them access to more places and activities.",
        "This encourages them to take responsibility for their own routine."
      ],
      "reason": [
        "Cities offer more transport options.",
        "Shops and services are usually closer together.",
        "Public places allow teenagers to meet friends easily.",
        "Large cities provide more after-school activities.",
        "Urban life encourages teenagers to make independent choices."
      ],
      "example": [
        "For example, city teenagers often take public transport to school.",
        "A young person in a city can visit libraries or sports centres on their own.",
        "Someone living in a city may travel to music lessons independently.",
        "A teenager in an urban area can meet friends without needing a car.",
        "City students often walk to cafés or shops after school."
      ],
      "result": [
        "As a result, teenagers become more confident in daily life.",
        "This helps them organise their own schedules.",
        "This often prepares them for adult responsibilities.",
        "This can improve problem-solving in real situations.",
        "This encourages them to explore new interests."
      ],
      "reformulate": [
        "In other words, city life helps teenagers become more independent.",
        "Put simply, living in a city gives young people more freedom.",
        "To say it another way, urban areas help teenagers manage life on their own.",
        "In short, cities support independent routines.",
        "To summarise, living in a big city increases teenage independence."
      ],
      "compare": [
        "Compared to small towns, cities offer more places teenagers can visit alone.",
        "Unlike quiet villages, cities have more transport choices.",
        "Compared to rural areas, city life gives teenagers more freedom.",
        "Unlike small communities, cities provide more activities nearby.",
        "Compared to countryside living, city life feels more independent."
      ],
      "contrast": [
        "However, city life can feel busy or overwhelming.",
        "On the other hand, transport can be crowded and stressful.",
        "In contrast, small towns feel safer for some families.",
        "However, independence sometimes leads to risky choices.",
        "On the other hand, not all teenagers enjoy busy city life."
      ]
    },
    {
      "id": 22,
      "base": "Living in a small town creates a calmer daily routine.",
      "explain": [
        "This means life feels less rushed.",
        "This helps people relax during everyday activities.",
        "This makes school mornings feel less stressful.",
        "This gives teenagers more time to enjoy quiet moments.",
        "This encourages a slower and more comfortable lifestyle."
      ],
      "reason": [
        "Small towns have less traffic and noise.",
        "Shops and schools are usually close to home.",
        "People often know each other well in small communities.",
        "Crowds are smaller, so daily tasks feel easier.",
        "Local areas tend to be quieter and more peaceful."
      ],
      "example": [
        "For example, a teenager in a small town may walk to school without rushing.",
        "A young person can visit friends without dealing with heavy traffic.",
        "Someone living locally may enjoy peaceful parks and open spaces.",
        "A student might have more quiet time for hobbies after school.",
        "Families in small towns often enjoy slower, more relaxed weekends."
      ],
      "result": [
        "As a result, teenagers feel less stressed during the week.",
        "This helps them stay calm during homework or revision.",
        "This often improves their mood and wellbeing.",
        "This can support better concentration at school.",
        "This encourages stronger connections with local people."
      ],
      "reformulate": [
        "In other words, small towns offer a more peaceful routine.",
        "Put simply, life feels calmer in smaller communities.",
        "To say it another way, small-town living reduces daily stress.",
        "In short, small towns create quieter lifestyles.",
        "To summarise, small-town life supports a more relaxed routine."
      ],
      "compare": [
        "Compared to cities, small towns feel quieter and calmer.",
        "Unlike busy urban areas, small towns have fewer crowds.",
        "Compared to large cities, local life moves more slowly.",
        "Unlike noisy environments, small towns feel more peaceful.",
        "Compared to urban living, small towns offer more quiet spaces."
      ],
      "contrast": [
        "However, some teenagers find small towns too quiet.",
        "On the other hand, there may be fewer entertainment options.",
        "In contrast, cities offer more excitement and variety.",
        "However, small towns can feel isolated for some young people.",
        "On the other hand, fewer transport options can limit independence."
      ]
    },
    {
      "id": 23,
      "base": "Public transport helps students travel easily without a car.",
      "explain": [
        "This means they can move around independently.",
        "This helps them reach school or activities safely.",
        "This makes long distances feel easier to manage.",
        "This gives them reliable ways to get around.",
        "This encourages freedom of movement for young people."
      ],
      "reason": [
        "Buses and trains follow regular timetables.",
        "Public transport is cheaper than owning a car.",
        "Transport services connect many important locations.",
        "Students often receive discounted fares.",
        "Large cities have many different transport options."
      ],
      "example": [
        "For example, a student can take the bus to school every morning.",
        "A teenager might use the train to visit friends in another area.",
        "Someone can take the tram to a sports centre.",
        "A pupil might use the underground to reach a museum.",
        "Students often rely on buses for weekend activities."
      ],
      "result": [
        "As a result, teenagers feel more independent.",
        "This helps them join after-school clubs more easily.",
        "This often reduces pressure on parents.",
        "This can improve punctuality for school and activities.",
        "This encourages teenagers to explore their local area."
      ],
      "reformulate": [
        "In other words, public transport helps students travel on their own.",
        "Put simply, buses and trains give teenagers more freedom.",
        "To say it another way, public transport supports independent travel.",
        "In short, transport services help young people get around easily.",
        "To summarise, public transport allows students to travel without needing a car."
      ],
      "compare": [
        "Compared to walking long distances, buses are much faster.",
        "Unlike taxis, public transport is more affordable.",
        "Compared to relying on parents, buses give more independence.",
        "Unlike cars, buses provide shared travel for many people.",
        "Compared to cycling in bad weather, public transport feels more comfortable."
      ],
      "contrast": [
        "However, buses can be late during busy times.",
        "On the other hand, some areas have limited transport routes.",
        "In contrast, cars offer more privacy and flexibility.",
        "However, crowded buses can feel uncomfortable.",
        "On the other hand, confusing timetables can cause problems for new users."
      ]
    }
    {
      "id": 24,
      "base": "Gardening helps young people feel more connected to nature.",
      "explain": [
        "This means they spend more time outdoors.",
        "This helps them understand how plants grow.",
        "This makes them notice changes in seasons and weather.",
        "This gives them a calming environment to work in.",
        "This encourages appreciation for the natural world."
      ],
      "reason": [
        "Gardening involves caring for plants directly.",
        "Young people observe natural processes while gardening.",
        "Outdoor work keeps them close to nature.",
        "Growing plants requires attention to soil, water and sunlight.",
        "Nature-based activities build awareness of the environment."
      ],
      "example": [
        "For example, a student planting vegetables learns how food grows.",
        "A teenager who looks after flowers becomes more aware of the weather.",
        "Someone who grows herbs enjoys seeing daily progress.",
        "A pupil who looks after a school garden connects with nature regularly.",
        "Young people who care for plants understand more about living things."
      ],
      "result": [
        "As a result, teenagers feel calmer and more relaxed.",
        "This helps them appreciate outdoor spaces more.",
        "This often improves their mood and wellbeing.",
        "This can encourage healthier outdoor habits.",
        "This inspires interest in protecting nature."
      ],
      "reformulate": [
        "In other words, gardening makes young people feel closer to nature.",
        "Put simply, taking care of plants connects teenagers with the natural world.",
        "To say it another way, gardening increases awareness of nature.",
        "In short, garden activities help students feel more in touch with the environment.",
        "To summarise, gardening builds a stronger connection with nature."
      ],
      "compare": [
        "Compared to indoor hobbies, gardening brings young people outside.",
        "Unlike screen-based activities, gardening involves real natural experiences.",
        "Compared to artificial environments, gardens feel more peaceful.",
        "Unlike indoor tasks, gardening shows progress in living things.",
        "Compared to quiet indoor work, outdoor gardening feels more refreshing."
      ],
      "contrast": [
        "However, not all teenagers enjoy outdoor activities.",
        "On the other hand, gardening requires time and patience.",
        "In contrast, indoor hobbies can feel easier to start.",
        "However, gardening depends heavily on weather conditions.",
        "On the other hand, some students prefer fast-paced activities."
      ]
    },
    {
      "id": 25,
      "base": "Basic cooking skills make teenage life more independent.",
      "explain": [
        "This means teenagers can prepare simple meals on their own.",
        "This helps them feel more confident at home.",
        "This makes daily routines easier to manage.",
        "This gives them control over their food choices.",
        "This encourages responsible habits."
      ],
      "reason": [
        "Cooking skills allow teenagers to look after themselves.",
        "Knowing how to cook prevents reliance on others.",
        "Simple recipes are easy to learn at home.",
        "Cooking helps teenagers understand nutrition.",
        "Practical kitchen skills support daily independence."
      ],
      "example": [
        "For example, a teenager who can cook pasta can make dinner when parents are busy.",
        "Someone who can prepare breakfast feels more independent in the morning.",
        "A student who cooks simple meals chooses healthier options.",
        "A young person who helps in the kitchen gains confidence quickly.",
        "Teenagers who cook for themselves rely less on takeaway food."
      ],
      "result": [
        "As a result, teenagers feel more capable in daily life.",
        "This helps them prepare for living away from home.",
        "This often leads to healthier eating habits.",
        "This can reduce stress in busy households.",
        "This encourages a sense of responsibility."
      ],
      "reformulate": [
        "In other words, cooking skills make teenagers more independent.",
        "Put simply, knowing how to cook increases self-reliance.",
        "To say it another way, cooking helps teenagers look after themselves.",
        "In short, basic cooking supports independent living.",
        "To summarise, kitchen skills build teenage independence."
      ],
      "compare": [
        "Compared to teenagers who never cook, those with skills feel more confident.",
        "Unlike ready meals, cooking allows more control over ingredients.",
        "Compared to depending on parents, cooking gives more freedom.",
        "Unlike ordering food, home cooking builds practical skills.",
        "Compared to takeaway options, cooking at home feels healthier."
      ],
      "contrast": [
        "However, some teenagers lack interest in cooking.",
        "On the other hand, cooking can be time-consuming.",
        "In contrast, some young people prefer quick snacks.",
        "However, kitchen equipment is not always available.",
        "On the other hand, cooking mistakes can be discouraging."
      ]
    },
    {
      "id": 26,
      "base": "Learning to code gives students valuable problem-solving experience.",
      "explain": [
        "This means they learn to think through challenges step by step.",
        "This helps them understand how to fix mistakes in their work.",
        "This makes logical thinking easier for them.",
        "This gives them practice in breaking down complex tasks.",
        "This encourages analytical thinking skills."
      ],
      "reason": [
        "Coding requires clear instructions.",
        "Solving errors is part of programming.",
        "Computer tasks involve logical steps.",
        "Coding projects demand structured thinking.",
        "Debugging teaches patience and focus."
      ],
      "example": [
        "For example, a student who writes simple programmes learns how to fix errors.",
        "A teenager who builds a basic game practises logical thinking.",
        "Someone who codes websites learns to solve small technical problems.",
        "A pupil who completes coding challenges develops problem-solving skills.",
        "Students writing code for school projects learn how to approach complex tasks."
      ],
      "result": [
        "As a result, students become more confident with challenging tasks.",
        "This helps them improve performance in technical subjects.",
        "This often increases interest in computer science.",
        "This can support future career opportunities.",
        "This encourages careful and organised thinking."
      ],
      "reformulate": [
        "In other words, coding helps students develop strong problem-solving skills.",
        "Put simply, programming teaches logical thinking.",
        "To say it another way, coding trains students to solve problems effectively.",
        "In short, programming develops structured thinking.",
        "To summarise, coding gives valuable experience in solving problems."
      ],
      "compare": [
        "Compared to simple computer use, coding demands deeper thinking.",
        "Unlike basic digital tasks, programming requires careful planning.",
        "Compared to other subjects, coding involves more trial and error.",
        "Unlike art activities, coding focuses on precise instructions.",
        "Compared to everyday computer use, coding develops stronger logic skills."
      ],
      "contrast": [
        "However, some students find coding frustrating at first.",
        "On the other hand, programming errors can take time to fix.",
        "In contrast, creative subjects feel more flexible.",
        "However, not all schools have access to coding lessons.",
        "On the other hand, some teenagers prefer hands-on activities."
      ]
    },
    {
      "id": 27,
      "base": "Keeping a journal helps teenagers organise their thoughts.",
      "explain": [
        "This means they can understand their feelings more clearly.",
        "This helps them reflect on daily experiences.",
        "This makes it easier to plan future goals.",
        "This gives them a private space to express ideas.",
        "This encourages calm and thoughtful thinking."
      ],
      "reason": [
        "Writing things down helps clear the mind.",
        "Journals allow teenagers to track experiences.",
        "Reflection supports emotional awareness.",
        "Organising ideas on paper helps decision-making.",
        "Daily writing builds routine and focus."
      ],
      "example": [
        "For example, a teenager may write about school challenges to understand them better.",
        "Someone who keeps a journal can track progress on personal goals.",
        "A pupil might record positive moments from each day.",
        "Young people often write about friendships to make sense of situations.",
        "Students who journal regularly stay more organised."
      ],
      "result": [
        "As a result, teenagers feel calmer and more focused.",
        "This helps them make clearer choices.",
        "This often improves emotional wellbeing.",
        "This can reduce stress during busy school periods.",
        "This encourages healthier thinking habits."
      ],
      "reformulate": [
        "In other words, journalling helps teenagers manage their thoughts.",
        "Put simply, writing a journal makes ideas clearer.",
        "To say it another way, keeping a journal supports organised thinking.",
        "In short, writing regularly helps young people understand their thoughts.",
        "To summarise, journalling improves mental organisation."
      ],
      "compare": [
        "Compared to keeping thoughts private, writing makes ideas easier to manage.",
        "Unlike talking to friends, journals offer a private space.",
        "Compared to digital notes, handwriting feels more personal.",
        "Unlike quick messages, journalling encourages deeper thinking.",
        "Compared to not reflecting, journalling builds clearer understanding."
      ],
      "contrast": [
        "However, some teenagers find writing every day difficult.",
        "On the other hand, journals take time to maintain.",
        "In contrast, some young people prefer digital tools.",
        "However, not everyone enjoys writing about personal feelings.",
        "On the other hand, messy handwriting can make journalling less enjoyable."
      ]
    },
    {
      "id": 28,
      "base": "Playing strategy games develops decision-making skills.",
      "explain": [
        "This means players learn to think ahead.",
        "This helps them choose the best option in difficult situations.",
        "This makes planning feel more natural over time.",
        "This gives them practice in evaluating different outcomes.",
        "This encourages careful thinking before acting."
      ],
      "reason": [
        "Strategy games often require long-term planning.",
        "Players must analyse different choices.",
        "Games present challenges that need solutions.",
        "Winning depends on choosing the best strategy.",
        "Decision-making is essential to progress in many games."
      ],
      "example": [
        "For example, a student playing chess learns to plan several moves ahead.",
        "A teenager who plays strategy video games practises decision-making.",
        "Someone who plays board games learns to evaluate risks.",
        "A pupil who enjoys turn-based games thinks through each action carefully.",
        "Young people who solve game challenges develop logical thinking."
      ],
      "result": [
        "As a result, teenagers make decisions more confidently.",
        "This helps them solve problems more effectively.",
        "This often improves thinking in school subjects.",
        "This can increase patience and concentration.",
        "This encourages teenagers to evaluate choices in real life."
      ],
      "reformulate": [
        "In other words, strategy games improve decision-making.",
        "Put simply, thinking games help students choose wisely.",
        "To say it another way, strategic play builds planning skills.",
        "In short, strategy games develop logical decision-making.",
        "To summarise, playing strategy games strengthens thinking skills."
      ],
      "compare": [
        "Compared to action games, strategy games require more thought.",
        "Unlike fast-paced games, strategy games focus on planning.",
        "Compared to chance-based games, strategy games reward careful decisions.",
        "Unlike simple puzzles, strategy games involve long-term thinking.",
        "Compared to passive activities, strategic games build active thinking skills."
      ],
      "contrast": [
        "However, some teenagers find strategy games too slow.",
        "On the other hand, complex games can feel overwhelming.",
        "In contrast, action games offer more instant excitement.",
        "However, strategy games require more patience than many players have.",
        "On the other hand, not all students enjoy problem-solving games."
      ]
    },
    {
      "id": 29,
      "base": "Taking regular breaks makes long study sessions more productive.",
      "explain": [
        "This means students return to work with clearer focus.",
        "This helps them avoid feeling too tired or stressed.",
        "This makes studying feel easier to continue.",
        "This gives the brain time to rest for a few minutes.",
        "This encourages healthier study habits."
      ],
      "reason": [
        "Short breaks prevent mental exhaustion.",
        "Rest allows the brain to reset.",
        "Working for too long reduces concentration.",
        "Breaks make it easier to remember information.",
        "A balanced routine supports better learning."
      ],
      "example": [
        "For example, a student who takes five-minute breaks studies more effectively.",
        "Someone who stretches between tasks feels more comfortable.",
        "A teenager who pauses after each chapter stays focused longer.",
        "A pupil who takes short walks during revision feels less stressed.",
        "Students who rest during study sessions avoid burnout."
      ],
      "result": [
        "As a result, studying feels less overwhelming.",
        "This helps students learn more in the same amount of time.",
        "This often improves exam performance.",
        "This can reduce anxiety during revision periods.",
        "This encourages a more organised study routine."
      ],
      "reformulate": [
        "In other words, taking breaks increases study productivity.",
        "Put simply, short rests make studying more effective.",
        "To say it another way, regular pauses improve learning.",
        "In short, breaks make long sessions easier to handle.",
        "To summarise, study breaks boost productivity."
      ],
      "compare": [
        "Compared to studying non-stop, taking breaks leads to better focus.",
        "Unlike long continuous sessions, broken sessions feel more comfortable.",
        "Compared to rushing work, planned breaks improve quality.",
        "Unlike last-minute cramming, steady study with breaks is healthier.",
        "Compared to tired studying, rested studying is more effective."
      ],
      "contrast": [
        "However, some students take breaks that are too long.",
        "On the other hand, distractions can ruin break routines.",
        "In contrast, some teenagers prefer to finish everything at once.",
        "However, too many breaks can slow progress.",
        "On the other hand, some students forget to return to work."
      ]
    },
    {
      "id": 30,
      "base": "Spending time with family gives young people emotional support.",
      "explain": [
        "This means they feel understood by people who care about them.",
        "This helps them deal with stress more easily.",
        "This makes difficult situations feel less overwhelming.",
        "This gives them a safe space to share worries.",
        "This encourages stronger, healthier relationships."
      ],
      "reason": [
        "Family members often know teenagers well.",
        "Home provides a comfortable environment.",
        "Support from relatives builds emotional strength.",
        "Positive conversations reduce stress.",
        "Family routines help teenagers feel secure."
      ],
      "example": [
        "For example, talking to parents can help teenagers solve problems.",
        "A young person might feel calmer after spending an evening with siblings.",
        "Someone may enjoy sharing meals with their family after a long day.",
        "A teenager may open up to relatives about school challenges.",
        "Students who spend time with family often feel more supported emotionally."
      ],
      "result": [
        "As a result, young people feel more confident in daily life.",
        "This helps them handle stress in healthy ways.",
        "This often strengthens family relationships.",
        "This can improve emotional wellbeing over time.",
        "This encourages teenagers to communicate openly."
      ],
      "reformulate": [
        "In other words, time with family supports emotional wellbeing.",
        "Put simply, being with family provides comfort.",
        "To say it another way, family time builds emotional strength.",
        "In short, spending time with relatives gives emotional support.",
        "To summarise, family time helps teenagers feel emotionally secure."
      ],
      "compare": [
        "Compared to being alone, family time feels more supportive.",
        "Unlike time with classmates, family conversations can feel safer.",
        "Compared to online chats, family time offers real emotional comfort.",
        "Unlike busy social events, quiet family time feels more relaxing.",
        "Compared to strangers, relatives provide more consistent support."
      ],
      "contrast": [
        "However, some teenagers find it difficult to open up to family.",
        "On the other hand, busy schedules reduce time together.",
        "In contrast, some families experience conflict.",
        "However, too much family pressure can feel stressful.",
        "On the other hand, not all teens feel supported at home."
      ]
    }
  ]
}

