{
  "sentences": [
    {
  "id": 1,
  "base": "The school library has become a popular place for students during break times.",
  "explain": [
    "This means more students are using the space to read or work quietly.",
    "This helps create a calmer atmosphere compared to other areas of the school.",
    "This makes it easier for students to focus on homework or revision."
  ],
  "reason": [
    "Many students prefer the quiet environment the library provides.",
    "The library recently added new study tables and comfortable chairs.",
    "There is now a wider range of books that appeal to teenagers."
  ],
  "example": [
    "For example, the new graphic novels section attracts many younger students.",
    "A group of Year 10 students now meet there every day to work on projects.",
    "Several students say they use the space to revise before tests."
  ],
  "result": [
    "As a result, the library is often full during lunch and breaks.",
    "This improves the overall working habits of many students.",
    "This often leads to more students completing homework on time."
  ],
  "reformulate": [
    "In other words, the library plays an increasingly important role in school life.",
    "Put simply, it has become a helpful study space for many students.",
    "To summarise, the library is now one of the most used facilities in the school."
  ],
  "compare": [
    "Compared to the noisy canteen, the library offers a much calmer space.",
    "Unlike outdoor areas, the library is useful in all weather conditions.",
    "Compared to last year, far more students use the library regularly."
  ],
  "contrast": [
    "However, the space sometimes becomes overcrowded.",
    "On the other hand, not all students enjoy quiet environments.",
    "In contrast, some students still prefer working in open study areas."
  ]
},
{
  "id": 2,
  "base": "The school cafeteria has introduced a new menu to offer healthier options.",
  "explain": [
    "This means students can choose meals that support a balanced diet.",
    "This helps encourage better eating habits during the school day.",
    "This makes lunchtime more enjoyable for many teenagers."
  ],
  "reason": [
    "The school wanted to reduce the amount of unhealthy food available.",
    "Students requested more vegetarian and vegan options.",
    "The kitchen upgraded its equipment to prepare fresher meals."
  ],
  "example": [
    "For example, the new salads and wraps have become very popular.",
    "A group of students reported that they now eat fruit more often.",
    "Several teachers say the cafeteria feels more organised during busy times."
  ],
  "result": [
    "As a result, students are making healthier choices more regularly.",
    "This has improved the overall atmosphere at lunchtime.",
    "This often reduces queues because meals are prepared more efficiently."
  ],
  "reformulate": [
    "In other words, the new menu has improved the quality of school lunches.",
    "Put simply, students now have better food options.",
    "To summarise, the changes have made lunchtime healthier and more enjoyable."
  ],
  "compare": [
    "Compared to the old menu, there is a wider range of nutritious meals.",
    "Unlike fast-food style items, the new options are freshly prepared.",
    "Compared to nearby shops, the cafeteria now offers better value."
  ],
  "contrast": [
    "However, some students still prefer the previous menu.",
    "On the other hand, healthier meals take longer to prepare.",
    "In contrast, some schools offer a greater variety of international dishes."
  ]
},
{
  "id": 3,
  "base": "The school sports hall is now used more frequently for after-school clubs.",
  "explain": [
    "This means students have more opportunities to participate in physical activities.",
    "This helps promote teamwork and improves fitness levels.",
    "This makes the sports hall an important facility for many students."
  ],
  "reason": [
    "Several new clubs have been introduced, including basketball and badminton.",
    "More teachers have volunteered to run after-school activities.",
    "The school wants to encourage students to stay active."
  ],
  "example": [
    "For example, the basketball club now attracts over thirty students each week.",
    "A group of Year 8 students said they enjoy staying after school to play badminton.",
    "Some students attend clubs almost every day because of the improved timetable."
  ],
  "result": [
    "As a result, the sports hall is busier than ever.",
    "This increases students’ motivation to stay active.",
    "This often leads to improved health and confidence."
  ],
  "reformulate": [
    "In other words, the sports hall has become a key part of school life.",
    "Put simply, more students are using the space for activities.",
    "To summarise, after-school sports have become much more popular."
  ],
  "compare": [
    "Compared to previous years, participation has increased significantly.",
    "Unlike outdoor pitches, the sports hall can be used all year round.",
    "Compared to smaller schools, our sports facilities are well equipped."
  ],
  "contrast": [
    "However, the hall is sometimes fully booked.",
    "On the other hand, not all sports can be played indoors.",
    "In contrast, some students prefer outdoor activities."
  ]
},
{
  "id": 4,
  "base": "The ICT room has been upgraded to improve access to modern technology.",
  "explain": [
    "This means students can now use faster computers for schoolwork.",
    "This helps make lessons more interactive and engaging.",
    "This makes it easier for students to complete digital projects."
  ],
  "reason": [
    "The school invested in new equipment and software.",
    "Teachers requested better resources to support modern lessons.",
    "Many subjects now require up-to-date digital tools."
  ],
  "example": [
    "For example, ICT classes now run more smoothly because the systems load faster.",
    "Students can complete research projects without technical problems.",
    "Several classes recently used design software to create presentations."
  ],
  "result": [
    "As a result, ICT lessons feel more efficient and enjoyable.",
    "This improves students’ confidence with technology.",
    "This often leads to higher-quality work."
  ],
  "reformulate": [
    "In other words, the ICT room now offers much better resources.",
    "Put simply, technology at school has improved noticeably.",
    "To summarise, the upgrades have made digital learning easier."
  ],
  "compare": [
    "Compared to the old computers, the new ones are much quicker.",
    "Unlike previous years, technology rarely causes delays.",
    "Compared to other schools, the ICT room is now well equipped."
  ],
  "contrast": [
    "However, there are still not enough computers for every student.",
    "On the other hand, some software programs take time to learn.",
    "In contrast, some students prefer working on their own laptops."
   ]
},
{
  "id": 5,
  "base": "The local shopping centre has become a popular meeting place for teenagers.",
  "explain": [
    "This means many students go there after school to relax or shop.",
    "This helps create a lively atmosphere in the afternoons.",
    "This makes it a convenient place for young people to spend time together."
  ],
  "reason": [
    "There are a variety of affordable shops that appeal to teenagers.",
    "The centre offers comfortable seating areas for socialising.",
    "Public transport makes it easy for students to reach the location."
  ],
  "example": [
    "For example, many teenagers visit the gaming store or the snack stalls.",
    "A group of friends from my class meet there every Friday.",
    "Several students say it is the only place nearby with enough space to hang out."
  ],
  "result": [
    "As a result, the centre is often crowded after school.",
    "This increases business for local shops.",
    "This often leads to long queues at popular stores."
  ],
  "reformulate": [
    "In other words, the shopping centre has become a key social spot for young people.",
    "Put simply, teenagers enjoy meeting there regularly.",
    "To summarise, it plays an important role in the local community."
  ],
  "compare": [
    "Compared to smaller shops, the centre offers more choice.",
    "Unlike parks, it provides shelter in bad weather.",
    "Compared to online shopping, the centre feels more social."
  ],
  "contrast": [
    "However, not all parents feel it is a safe environment.",
    "On the other hand, some shops are too expensive for teenagers.",
    "In contrast, town cafés can be much quieter."
  ]
},
{
  "id": 6,
  "base": "The local market has grown more popular with families and students.",
  "explain": [
    "This means more people are visiting it at weekends and after school.",
    "This helps support small local businesses.",
    "This makes the area feel more active and welcoming."
  ],
  "reason": [
    "The market offers a mix of food stalls and handmade products.",
    "Prices are affordable, which appeals to younger visitors.",
    "The location is right in the town centre, making it easy to access."
  ],
  "example": [
    "For example, many students buy snacks from the international food stalls.",
    "A friend of mine goes there every week to look for second-hand books.",
    "Several families say they enjoy the friendly atmosphere."
  ],
  "result": [
    "As a result, the market is often busy, especially on Fridays.",
    "This increases income for many local vendors.",
    "This often encourages new stalls to open."
  ],
  "reformulate": [
    "In other words, the market has become an important community space.",
    "Put simply, it attracts a wide range of visitors.",
    "To summarise, its growth has benefited the area."
  ],
  "compare": [
    "Compared to supermarkets, the market feels more personal.",
    "Unlike online shops, visitors can see products directly.",
    "Compared to shopping centres, it offers a more relaxed environment."
  ],
  "contrast": [
    "However, the market can be crowded during peak times.",
    "On the other hand, some stalls close earlier than expected.",
    "In contrast, supermarkets offer more consistent prices."
  ]
},
{
  "id": 7,
  "base": "The new youth centre has started offering more after-school activities.",
  "explain": [
    "This means students have more options for spending their free time productively.",
    "This helps keep teenagers engaged and active.",
    "This makes the youth centre busier than it used to be."
  ],
  "reason": [
    "The centre hired extra staff to run workshops and sports sessions.",
    "Local funding allowed them to improve their facilities.",
    "They wanted to provide safe spaces for young people."
  ],
  "example": [
    "For example, the new art workshops have become very popular.",
    "A group of students attend the fitness classes every Tuesday.",
    "Several teenagers say they prefer it to staying at home alone."
  ],
  "result": [
    "As a result, the youth centre has seen a rise in membership.",
    "This improves young people’s confidence and social skills.",
    "This often reduces boredom and risky behaviour in the area."
  ],
  "reformulate": [
    "In other words, the youth centre now offers more valuable activities.",
    "Put simply, it has become a more useful place for teenagers.",
    "To summarise, the improvements have made the centre more popular."
  ],
  "compare": [
    "Compared to last year, attendance has increased significantly.",
    "Unlike sports clubs, the centre offers a wider range of creative activities.",
    "Compared to staying at home, it provides a more social environment."
  ],
  "contrast": [
    "However, some sessions fill up too quickly.",
    "On the other hand, not all teenagers enjoy structured activities.",
    "In contrast, outdoor parks offer more freedom."
  ]
},
{
  "id": 8,
  "base": "The B2 English course in Dublin has received positive feedback from students.",
  "explain": [
    "This means many students feel their English improved during the course.",
    "This helps teenagers build confidence when speaking to others.",
    "This makes the course suitable for international students."
  ],
  "reason": [
    "Teachers use interactive activities and real-life situations.",
    "Students practise speaking every day with classmates.",
    "The course includes cultural visits around Dublin."
  ],
  "example": [
    "For example, one student said the city tours helped him learn new vocabulary.",
    "Many students enjoyed practising English in cafés and shops.",
    "A friend of mine said she felt more confident after just two weeks."
  ],
  "result": [
    "As a result, most students recommend the course to others.",
    "This encourages more teenagers to study abroad.",
    "This often leads to lasting friendships between international students."
  ],
  "reformulate": [
    "In other words, the course is effective and enjoyable.",
    "Put simply, it helps students improve quickly.",
    "To summarise, the combination of lessons and activities makes it successful."
  ],
  "compare": [
    "Compared to online courses, this one feels more immersive.",
    "Unlike regular school lessons, the course focuses on communication.",
    "Compared to similar programmes, it offers more cultural experiences."
  ],
  "contrast": [
    "However, the course can be expensive for some families.",
    "On the other hand, the schedule can feel intense.",
    "In contrast, local English classes may feel more relaxed."
 ]
},
{
  "id": 9,
  "base": "The town sports centre has become a key place for young people to exercise after school.",
  "explain": [
    "This means more teenagers are choosing to stay active during the week.",
    "This helps improve students’ health and wellbeing.",
    "This makes the sports centre an important part of the local community."
  ],
  "reason": [
    "The centre offers affordable membership for students.",
    "New equipment was added to make workouts more enjoyable.",
    "The timetable includes classes suitable for all fitness levels."
  ],
  "example": [
    "For example, the evening fitness class is often full of teenagers.",
    "A friend of mine goes there twice a week to play badminton.",
    "Many students say the gym feels more welcoming than before."
  ],
  "result": [
    "As a result, more young people are taking part in physical activity.",
    "This improves their confidence and physical strength.",
    "This often motivates teenagers to maintain healthy habits."
  ],
  "reformulate": [
    "In other words, the centre plays a big role in supporting youth fitness.",
    "Put simply, it’s a popular place for teenagers to exercise.",
    "To summarise, the improvements have made the centre more useful."
  ],
  "compare": [
    "Compared to outdoor parks, the sports centre can be used all year round.",
    "Unlike expensive gyms, it offers student discounts.",
    "Compared to last year, attendance has increased noticeably."
  ],
  "contrast": [
    "However, the centre can become crowded at peak times.",
    "On the other hand, not all teenagers enjoy structured exercise.",
    "In contrast, outdoor sports areas allow more free play."
  ]
},
{
  "id": 10,
  "base": "The local bus service has become more reliable for students travelling to school.",
  "explain": [
    "This means students arrive on time more often.",
    "This helps reduce stress in the mornings.",
    "This makes travelling to school much easier for many families."
  ],
  "reason": [
    "The bus company increased the number of morning routes.",
    "Drivers received training to help keep the service punctual.",
    "The timetable was updated to match school start times."
  ],
  "example": [
    "For example, the 8:10 bus now arrives almost exactly on schedule.",
    "A group of students told me they no longer need to rush every morning.",
    "Several parents reported fewer problems with lateness."
  ],
  "result": [
    "As a result, students feel more prepared for lessons.",
    "This reduces stress for both students and teachers.",
    "This often improves overall punctuality at school."
  ],
  "reformulate": [
    "In other words, the bus service has become more dependable.",
    "Put simply, travelling by bus is now easier and more efficient.",
    "To summarise, the improvements have made the service more reliable."
  ],
  "compare": [
    "Compared to last year, the buses are far more punctual.",
    "Unlike walking or cycling, the bus is quicker over longer distances.",
    "Compared to other towns, our bus service is now well managed."
  ],
  "contrast": [
    "However, buses still get crowded on rainy days.",
    "On the other hand, some routes remain slow in heavy traffic.",
    "In contrast, cycling offers more flexibility."
  ]
},
{
  "id": 11,
  "base": "The town park has become more attractive since the recent improvements.",
  "explain": [
    "This means more families and teenagers now spend time there.",
    "This helps the community enjoy outdoor activities together.",
    "This makes the park a popular weekend destination."
  ],
  "reason": [
    "New benches and walking paths were added.",
    "The playground was repaired and updated.",
    "The council planted new trees and flowers across the park."
  ],
  "example": [
    "For example, many teenagers use the new basketball court after school.",
    "A friend of mine enjoys walking there with her dog.",
    "Families often come for picnics when the weather is warm."
  ],
  "result": [
    "As a result, the park feels cleaner and safer.",
    "This encourages people to spend more time outdoors.",
    "This often leads to more community events being held there."
  ],
  "reformulate": [
    "In other words, the park improvements have made a big difference.",
    "Put simply, it’s now a pleasant place to visit.",
    "To summarise, the upgrades have made the park much more attractive."
  ],
  "compare": [
    "Compared to other local parks, this one feels better maintained.",
    "Unlike busy town areas, the park offers peace and quiet.",
    "Compared to last year, the facilities are much improved."
  ],
  "contrast": [
    "However, the park can still get muddy in winter.",
    "On the other hand, some equipment might need more regular cleaning.",
    "In contrast, indoor centres offer activities all year round."
  ]
},
{
  "id": 12,
  "base": "The town library now provides more support for students working on school projects.",
  "explain": [
    "This means teenagers can find helpful resources more easily.",
    "This helps students complete homework to a higher standard.",
    "This makes the library a useful study space for exam preparation."
  ],
  "reason": [
    "The library added new computers and research tools.",
    "Staff now run weekly study sessions for teenagers.",
    "There is a dedicated area for group work."
  ],
  "example": [
    "For example, I used the new computers to finish a science project.",
    "A group of Year 11 students meet there every Monday to revise.",
    "Many teenagers say the staff are friendly and willing to help."
  ],
  "result": [
    "As a result, students feel more confident completing projects.",
    "This improves the overall quality of schoolwork.",
    "This often means more teenagers choose to study at the library."
  ],
  "reformulate": [
    "In other words, the library now supports students more effectively.",
    "Put simply, it has become a great place to study.",
    "To summarise, the new resources make project work easier."
  ],
  "compare": [
    "Compared to studying at home, the library offers fewer distractions.",
    "Unlike cafés, it is free and much quieter.",
    "Compared to last year, the facilities are far more student-friendly."
  ],
  "contrast": [
    "However, the library closes early on Fridays.",
    "On the other hand, group areas can be noisy at times.",
    "In contrast, school study rooms allow students to stay later."
  ]
},
{
  "id": 13,
  "base": "The school’s homework club has become increasingly useful for students who need extra support.",
  "explain": [
    "This means more teenagers are receiving help with difficult subjects.",
    "This helps reduce stress for students who struggle with deadlines.",
    "This makes the club a reliable option for students after school."
  ],
  "reason": [
    "Teachers are available to explain tasks clearly.",
    "The club provides a quiet environment for focused study.",
    "Students can access school computers and resources."
  ],
  "example": [
    "For example, several Year 9 students said the club helped them improve their maths grades.",
    "A friend of mine goes twice a week to finish science homework.",
    "Many teenagers attend before exams to revise with support."
  ],
  "result": [
    "As a result, students feel more confident about their assignments.",
    "This improves their overall academic performance.",
    "This often leads to better study habits at home."
  ],
  "reformulate": [
    "In other words, the homework club provides valuable academic support.",
    "Put simply, it helps students manage their work more effectively.",
    "To summarise, the club has become an important part of school life."
  ],
  "compare": [
    "Compared to studying alone, the club offers clearer guidance.",
    "Unlike private tutors, it is free for all students.",
    "Compared to last year, attendance has increased a lot."
  ],
  "contrast": [
    "However, the club can sometimes become overcrowded.",
    "On the other hand, not all subjects have specialist teachers available.",
    "In contrast, some students prefer studying quietly at home."
  ]
},
{
  "id": 14,
  "base": "The town’s new recycling programme has encouraged more young people to think about the environment.",
  "explain": [
    "This means teenagers are becoming more aware of how waste affects the community.",
    "This helps reduce the amount of rubbish thrown away in public areas.",
    "This makes the town cleaner and more environmentally friendly."
  ],
  "reason": [
    "New recycling bins were placed around schools and parks.",
    "Local campaigns taught students how to recycle correctly.",
    "The council organised events to promote environmental awareness."
  ],
  "example": [
    "For example, students took part in a weekend clean-up event.",
    "A friend of mine now recycles at home because of the school workshops.",
    "Several classes created posters to explain recycling rules."
  ],
  "result": [
    "As a result, recycling rates in the town have increased.",
    "This encourages families to adopt better habits.",
    "This often leads to a cleaner, more pleasant environment."
  ],
  "reformulate": [
    "In other words, the programme has had a positive impact on young people.",
    "Put simply, more students are recycling regularly.",
    "To summarise, the project has helped the community become greener."
  ],
  "compare": [
    "Compared to last year, awareness of recycling has grown significantly.",
    "Unlike other towns, ours provides recycling bins in almost every public space.",
    "Compared to older programmes, this one is much more organised."
  ],
  "contrast": [
    "However, some students still ignore the recycling bins.",
    "On the other hand, not all areas have enough containers.",
    "In contrast, some towns offer rewards for recycling."
  ]
},
{
  "id": 15,
  "base": "The town’s new study café has become popular with students preparing for exams.",
  "explain": [
    "This means teenagers have a comfortable place to revise outside school.",
    "This helps students focus for longer periods.",
    "This makes exam preparation feel less stressful."
  ],
  "reason": [
    "The café offers quiet study rooms and free Wi-Fi.",
    "Drinks and snacks are affordable for students.",
    "The space was designed specifically for studying."
  ],
  "example": [
    "For example, many older students spend weekends revising there.",
    "My friend uses the café to prepare for English exams.",
    "Several groups meet there to work on joint revision sessions."
  ],
  "result": [
    "As a result, students feel more motivated to revise.",
    "This supports stronger academic performance.",
    "This often leads to more productive study routines."
  ],
  "reformulate": [
    "In other words, the café provides a helpful study environment.",
    "Put simply, it’s an ideal place for exam preparation.",
    "To summarise, it has quickly become a favourite spot for students."
  ],
  "compare": [
    "Compared to noisy cafés, this one is much quieter.",
    "Unlike the school library, it stays open later in the evening.",
    "Compared to studying at home, it provides fewer distractions."
  ],
  "contrast": [
    "However, seats fill up quickly during exam season.",
    "On the other hand, some students find it too quiet.",
    "In contrast, school study rooms are closer for most teenagers."
  ]
}
  ]
}
